[
  {
    "id": "1",
    "name": "Max",
    "age": "1 year",
    "gender": "male",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Golden Retriever",
    "image": "https://www.zoo24.at/cdn/shop/articles/golden-retriever.jpg?v=1714469720&width=2048",
    "description": "Max is a friendly and playful 1-year-old male Golden Retriever looking for a loving home. He is castrated and has a sunny disposition that makes him an ideal companion for families, singles, or seniors. Max enjoys engaging in various activities such as fetching balls, running in the park, and swimming. He is known for his gentle nature and loyalty, making him great with kids and other pets. Max thrives on human interaction and would do best in a home where he gets plenty of attention and exercise. His previous owner had to relocate and couldn’t take him along, but Max has adjusted well and is ready to bring joy and companionship to his new family in New York. Max's training is coming along well, and he knows basic commands like sit, stay, and come. He's also house-trained and crate-trained, making the transition to his new home smoother. This affectionate pup is eager to please and looking for someone who will cherish him as much as he will love them.",
    "location": "New York",
    "liked": true
  },
  {
    "id": "2",
    "name": "Bella",
    "age": "8 years",
    "gender": "female",
    "castrated": "no",
    "type": "Cat",
    "breed": "Siamese",
    "image": "https://assets.elanco.com/8e0bf1c2-1ae4-001f-9257-f2be3c683fb1/fca42f04-2474-4302-a238-990c8aebfe8c/Siamese_cat_1110x740.jpg?w=3840&q=75&auto=format",
    "description": "Bella is an elegant and affectionate 8-year-old Siamese cat with a loving personality. She has a striking appearance with her sleek body, almond-shaped blue eyes, and short coat that is easy to maintain. Bella is not castrated and has a calm demeanor, making her a perfect companion for someone seeking a low-maintenance pet. She enjoys lounging in sunny spots, watching birds from the window, and snuggling up for a nap. Bella is also very communicative, often engaging in gentle conversations with her human companions. Although she prefers a quiet and stable environment, she adapts well to new situations and people. Bella's previous owner could no longer care for her due to health reasons, and she is now seeking a forever home where she can be pampered and loved. Bella would thrive in a home where she is the center of attention, and in return, she will provide years of love and companionship.",
    "location": "Los Angeles",
    "liked": false
  },
  {
    "id": "3",
    "name": "Charlie",
    "age": "5 months",
    "gender": "male",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Labrador Retriever",
    "image": "https://www.deine-hundeschule.at/wp-content/uploads/2016/10/shutterstock_297513161.jpg",
    "description": "Charlie is an energetic and loyal 5-month-old male Labrador Retriever ready for outdoor adventures. He is castrated and has a playful personality that makes him an excellent companion for active families. Charlie loves to explore new environments, chase after toys, and engage in spirited playtime. His enthusiasm for life is contagious, and he is always up for a game of fetch or a run in the park. Charlie is also very intelligent and eager to learn, making him a great candidate for further training. He knows basic commands and is quickly learning new ones. Charlie is also house-trained and crate-trained, which will help him adjust to his new home. This lovable pup is looking for a home where he can get plenty of exercise and mental stimulation. Charlie's ideal family would be one that enjoys the outdoors and can provide him with the attention and training he needs to thrive. He is ready to bring joy and energy to his new home and become a cherished member of the family.",
    "location": "Chicago",
    "liked": false
  },
  {
    "id": "4",
    "name": "Luna",
    "age": "5 years",
    "gender": "female",
    "castrated": "yes",
    "type": "Cat",
    "breed": "Maine Coon",
    "image": "https://media-eu.husse.com/media/1b/df/c1/1607081048/iStock-1031592516.jpg",
    "description":  "Luna is a curious and independent 5-year-old female Maine Coon who loves to explore her surroundings. She is castrated and has a majestic appearance with her large size, tufted ears, and bushy tail. Luna enjoys climbing, playing with toys, and observing the world from high vantage points. She is known for her gentle and friendly nature, making her a wonderful companion for families and individuals alike. Luna thrives on attention and enjoys being petted and groomed, though she also appreciates her alone time. Her previous owner had to give her up due to allergies, and Luna is now seeking a forever home where she can continue her adventures. Luna would do best in a home where she has plenty of space to roam and explore. She is good with other pets and children, making her a versatile addition to any household. Luna is ready to bring her charm and companionship to a new family and become a beloved member of the home.",
    "location": "Houston",
    "liked": false
  },
  {
    "id": "5",
    "name": "Pasha",
    "age": "2 years and 9 months",
    "gender": "male",
    "castrated": "no",
    "type": "Dog",
    "breed": "American Staffordshire Terrier",
    "image": "https://media.os.fressnapf.com/cms/2020/07/ratgeber_hund_rasse_portraits_american-staffordshire-terrier_1200x527.jpg?t=seoimgsqr_527",
    "description": "Pasha is a 2-year-and-9-month-old male American Staffordshire Terrier with a reserved yet affectionate personality. He was secured by the police in Wels and brought to the shelter by the animal rescue service after being found without an owner. Pasha is not castrated and has a sporty build, making him an excellent companion for an active individual or family. He is initially reserved around strangers but warms up once he gets to know someone. Pasha is cuddly and obedient, showing signs of prior training. However, he does not enjoy the company of other animals and would do best in a single-pet household. Pasha thrives on routine and structure, and he needs a home where he can feel secure and loved. His ideal owner would have experience with dogs and be able to provide him with the guidance and stability he needs. Pasha is ready to form a strong bond with a new family and become a loyal and loving companion.",
    "location": "Houston",
    "liked": false
  },
  {
    "id": "6",
    "name": "Cody",
    "age": "10 months",
    "gender": "male",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Alaskan Husky",
    "image": "https://www.dogster.com/wp-content/uploads/2024/03/husky-outdoor-barking_Sanchoz_Shutterstock.jpg",
    "description": "Cody is a friendly and open-minded 10-month-old male Alaskan Husky who is eager to find a loving home. He is castrated and has a bright, energetic personality that makes him a great companion for active individuals or families. Cody enjoys outdoor activities such as running, hiking, and playing in the snow. However, he has not yet learned to stay alone and needs a family that can provide him with the training and attention he requires. Cody is very social and loves interacting with people and other dogs. His ideal home would be one where he can be part of daily activities and receive plenty of exercise and mental stimulation. Cody's previous owner could not keep him due to time constraints, and he is now looking for a new family that can dedicate the time and effort to help him grow into a well-behaved and happy dog. Cody is ready to bring his cheerful spirit and boundless energy to a new home and become a cherished member of the family.",
    "location": "Brooklyn",
    "liked": false
  },
  {
    "id": "7",
    "name": "Churro",
    "age": "1 year and 5 months",
    "gender": "male",
    "castrated": "no",
    "type": "Dog",
    "breed": "American Staffordshire Terrier-Mix",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/American_Staffordshire_Terrier%28Cleo%29.JPG/640px-American_Staffordshire_Terrier%28Cleo%29.JPG",
    "description": "Churro is a lively and energetic 1-year-and-5-month-old male American Staffordshire Terrier-Mix who is looking for a dog-experienced home. He is not castrated and has a friendly and outgoing personality, making him a great companion for an active individual or family. Churro loves to play and engage in physical activities, and he thrives in an environment where he can get plenty of exercise and mental stimulation. He is also very intelligent and eager to learn, making him a great candidate for further training. Churro's previous owner had to give him up due to lifestyle changes, and he is now looking for a new family that can provide him with the time and attention he needs. Churro is good with people but may need some guidance when it comes to interacting with other animals. His ideal home would be one where he can be part of an active and loving family that understands his needs and can provide him with the training and socialization he requires.",
    "location": "Brooklyn",
    "liked": false
  },
  {
    "id": "8",
    "name": "Carita",
    "age": "5 year and 3 months",
    "gender": "female",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Dachshund",
    "image": "https://www.akc.org/wp-content/uploads/2017/11/Longhaired-Dachshund-standing-outdoors.jpg",
    "description": "Carita was passed on several times and finally ended up at our shelter. The little dog is very friendly towards people and extremely communicative. Unfortunately, Carita is terrified of thunderstorms, heavy rain and wind, where she goes completely berserk and can no longer be calmed down. When she is in this phase, she also destroys objects in her fear. Otherwise she is an uncomplicated, friendly and lovable companion.",
    "location": "Brooklyn",
    "liked": false
  },
  {
    "id": "9",
    "name": "Ares",
    "age": "7 year and 11 months",
    "gender": "male",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Malinois",
    "image": "https://www.zooplus.at/magazin/wp-content/uploads/2023/09/AdobeStock_83090056-768x512.jpeg",
    "description": "Ares is a basically friendly male dog, but he has had very little contact with other people and dogs in the last two years. He is docile and attentive and should definitely be taken to people with dog experience. He doesn't know children, so far he has only had two caregivers. He is also unfamiliar with cats and small animals.",
    "location": "Brooklyn",
    "liked": false
  },
  {
    "id": "10",
    "name": "Simba",
    "age": "3 years",
    "gender": "male",
    "castrated": "yes",
    "type": "Cat",
    "breed": "Bengal",
    "image": "https://blog.qualipet.ch/wp-content/uploads/2021/03/210315_Rassenportraits_Bengal.jpg",
    "description": "Simba is an adventurous and active cat who loves to climb and explore.",
    "location": "San Francisco",
    "liked": false
  },
  {
  "id": "11",
  "name": "Mittens",
  "age": "2 years",
    "gender": "male",
  "castrated": "no",
  "type": "Cat",
  "breed": "Persian",
  "image": "https://www.thesprucepets.com/thmb/5OSN_p9hUfPssKsJORQDGnAz_tQ=/1963x0/filters:no_upscale():strip_icc()/GettyImages-181861505-4e63227ed0a14dc9bfe86848ef54caf3.jpg",
  "description": "Mittens is a calm and gentle 2-year-old male Persian cat looking for a tranquil home. He is not castrated and has a luxurious, long coat that requires regular grooming to keep it looking its best. Mittens enjoys lounging in sunny spots and being pampered with gentle brushing and petting. He is a very laid-back cat who prefers a quiet environment where he can relax and feel safe. Mittens is also very affectionate and loves to snuggle with his human companions. He gets along well with other cats and is patient with children. Mittens is looking for a family that can provide him with the love and attention he deserves. His previous owner could no longer care for him due to health issues, so Mittens is now seeking a new home where he can continue to enjoy his peaceful lifestyle. He would thrive in a home where he can have his own space and plenty of cozy spots to relax. Mittens is ready to bring his calm and loving presence to a new family and become a cherished member of the home.",
    "location": "Boston",
    "liked": false
},
  {
    "id": "12",
    "name": "Oliver",
    "age": "6 months",
    "gender": "male",
    "castrated": "yes",
    "type": "Cat",
    "breed": "British Shorthair",
    "image": "https://www.shutterstock.com/image-photo/beautiful-blue-british-shorthair-little-600nw-1810220836.jpg",
    "description": "Oliver is a playful and curious 6-month-old male British Shorthair kitten looking for a loving home. He is castrated and has a plush, soft coat with a round face and big, expressive eyes. Oliver loves to play with toys and enjoys interactive games with his human companions. He is very social and gets along well with other pets and children. Oliver is also very affectionate and loves to cuddle and be petted. His previous owner had to move to a no-pets apartment, so Oliver is now looking for a new family where he can continue to explore and play. He would thrive in a home where he can be part of daily activities and receive plenty of love and attention. Oliver is ready to bring his playful energy and sweet personality to a new home and become a beloved member of the family.",
    "location": "Miami",
    "liked": false
  },
  {
    "id": "13",
    "name": "Daisy",
    "age": "4 years",
    "gender": "female",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Beagle",
    "image": "https://www.zooroyal.at/magazin/wp-content/uploads/2017/01/beagle-hunderasse-760x560.jpg",
    "description": "Daisy is a curious and friendly 4-year-old female Beagle looking for a loving home. She is castrated and has a beautiful tri-colored coat with expressive, soulful eyes. Daisy loves to sniff and explore the outdoors, making her an excellent companion for walks and adventures. She is very social and enjoys the company of other dogs and children. Daisy is also very affectionate and loves to cuddle with her human companions. Her previous owner could no longer care for her due to a change in circumstances, so Daisy is now seeking a new family where she can continue to explore and play. She would thrive in a home with a yard where she can run and sniff to her heart's content. Daisy is ready to bring her friendly and curious nature to a new family and become a beloved member of the home.",
    "location": "Seattle",
    "liked": false
  },
  {
    "id": "14",
    "name": "Rocky",
    "age": "7 years",
    "gender": "male",
    "castrated": "no",
    "type": "Dog",
    "breed": "Boxer",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Male_fawn_Boxer_undocked.jpg/1200px-Male_fawn_Boxer_undocked.jpg",
    "description": "Rocky is a loyal and protective 7-year-old male Boxer looking for a dedicated and loving owner. He is not castrated and has a strong, muscular build with a short, smooth coat. Rocky loves to be around his family and is very protective of his loved ones. He is also very playful and enjoys playing with toys and running around in the yard. Rocky is well-trained and knows basic commands. His previous owner could no longer care for him due to health issues, so Rocky is now seeking a new home where he can continue to be a loyal companion. He would thrive in a home with a yard where he can run and play. Rocky is good with children but may need some time to adjust to other pets. He is ready to bring his loyalty and playful energy to a new family and become a cherished member of the home.",
    "location": "Denver",
    "liked": false
  },
  {
    "id": "15",
    "name": "Lily",
    "age": "5 months",
    "gender": "female",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Cocker Spaniel",
    "image": "https://www.tierchenwelt.de/images/stories/haustiere/hunde/cocker_spaniel_suess_l.jpg",
    "description": "Lily is a sweet and affectionate 5-month-old female Cocker Spaniel puppy looking for a loving home. She is castrated and has a beautiful, silky coat with long ears and big, expressive eyes. Lily loves to play and enjoys cuddling with her human companions. She is very social and gets along well with other dogs and children. Lily is also very curious and loves to explore her surroundings. Her previous owner could no longer care for her due to personal reasons, so Lily is now seeking a new family where she can continue to play and be loved. She would thrive in a home where she can be part of daily activities and receive plenty of love and attention. Lily is ready to bring her sweet personality and playful energy to a new home and become a beloved member of the family.",
    "location": "Austin",
    "liked": false
  },
  {
    "id": "16",
    "name": "Thumper",
    "age": "1 year",
    "gender": "male",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Holland Lop",
    "image": "https://gregrichdvm.com/wp-content/uploads/2022/11/holland-lop-Metairie-LA.jpg",
    "description": "Thumper is a gentle and curious 1-year-old male Holland Lop rabbit looking for a loving home. He is castrated and has a soft, fluffy coat with adorable lop ears. Thumper loves to hop around and explore his surroundings. He is very social and enjoys being petted and cuddled. Thumper is also very playful and loves to interact with toys and other rabbits. His previous owner could no longer care for him due to a change in circumstances, so Thumper is now seeking a new family where he can continue to explore and play. He would thrive in a home where he can have plenty of space to hop around and receive lots of love and attention. Thumper is ready to bring his gentle and playful nature to a new family and become a beloved member of the home.",
    "location": "Portland",
    "liked": false
  },
  {
    "id": "17",
    "name": "BunBun",
    "age": "2 years",
    "gender": "female",
    "castrated": "no",
    "type": "Rabbit",
    "breed": "Lionhead",
    "image": "https://www.zooplus.co.uk/magazine/wp-content/uploads/2021/01/bicoloured-lionhead-rabbit.jpeg",
    "description": "BunBun is a fluffy and friendly 2-year-old female Lionhead rabbit looking for a loving home. She is not castrated and has a beautiful, fluffy coat that gives her a lion-like appearance. BunBun loves to be petted and enjoys playing with toys. She is very social and gets along well with other rabbits and children. BunBun is also very curious and loves to explore her surroundings. Her previous owner could no longer care for her due to personal reasons, so BunBun is now seeking a new family where she can continue to play and be loved. She would thrive in a home where she can have plenty of space to hop around and receive lots of love and attention. BunBun is ready to bring her fluffy and friendly nature to a new family and become a beloved member of the home.",
    "location": "San Diego",
    "liked": false
  },
  {
    "id": "18",
    "name": "Snowball",
    "age": "3 years",
    "gender": "male",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Angora",
    "image": "https://i.pinimg.com/736x/91/51/6b/91516bb1c240e4baa9f5198b190ef616.jpg",
    "description": "Snowball is a gentle and fluffy 3-year-old female Angora rabbit looking for a loving home. She is castrated and has a soft, fluffy coat that requires regular grooming to keep it looking its best. Snowball loves to hop around and explore her surroundings. She is very social and enjoys being petted and cuddled. Snowball is also very playful and loves to interact with toys and other rabbits. Her previous owner could no longer care for her due to a change in circumstances, so Snowball is now seeking a new family where she can continue to explore and play. She would thrive in a home where she can have plenty of space to hop around and receive lots of love and attention. Snowball is ready to bring her gentle and playful nature to a new family and become a beloved member of the home.",
    "location": "Las Vegas",
    "liked": true
  },
  {
    "id": "19",
    "name": "Whiskers",
    "age": "4 years",
    "gender": "male",
    "castrated": "yes",
    "type": "Cat",
    "breed": "Tabby",
    "image": "https://www.thesprucepets.com/thmb/whvFIY9Epn7ITmGk1pfYMuHCRO0=/1471x0/filters:no_upscale():strip_icc()/GettyImages-1288261359-4016b054680e41d28451f081babd0c45.jpg",
    "description": "Whiskers is a curious and playful cat who loves to chase toys and explore new places.",
    "location": "Dallas",
    "liked": true
  },
  {
    "id": "20",
    "name": "Cleo",
    "age": "1 year",
    "gender": "female",
    "castrated": "no",
    "type": "Cat",
    "breed": "Sphynx",
    "image": "https://www.catster.com/wp-content/uploads/2023/11/Fawn-Sphynx_sophiecat_Shutterstock-800x592.jpg",
    "description": "Cleo is a friendly and affectionate Sphynx cat who absolutely loves to be the center of attention. She enjoys being around people and thrives on interaction. Her hairless, velvety skin makes her a unique companion, and she loves the warmth of human contact. Cleo is known for her playful and curious nature, often following her favorite humans around the house. Despite her lack of fur, she is surprisingly warm and cuddly. She needs regular baths to keep her skin healthy, which she doesn’t mind as long as she gets extra affection afterwards. Cleo will make a wonderful addition to any home looking for a loving and devoted feline friend.",
    "location": "San Antonio",
    "liked": true
  },
  {
    "id": "21",
    "name": "Shadow",
    "age": "5 years",
    "gender": "female",
    "castrated": "yes",
    "type": "Cat",
    "breed": "Russian Blue",
    "image": "https://www.zooplus.co.uk/magazine/wp-content/uploads/2018/03/russian-blue-768x510.jpg",
    "description": "Shadow is a calm and gentle Russian Blue who enjoys her quiet time and cuddling with her favorite people. With her plush, silvery blue coat and striking green eyes, she is not only beautiful but also incredibly soothing to be around. Shadow is the perfect companion for someone who appreciates a more tranquil and serene atmosphere. She enjoys lounging in sunny spots and will happily sit beside you while you read or watch TV. Shadow is well-behaved and has a gentle disposition, making her an excellent pet for both individuals and families. She is also quite independent, perfectly content with some alone time, yet always ready to snuggle up when you need a purring friend.",
    "location": "Phoenix",
    "liked": false
  },
  {
    "id": "22",
    "name": "Felix",
    "age": "2 years",
    "gender": "male",
    "castrated": "yes",
    "type": "Cat",
    "breed": "Ragdoll",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Ragdoll%2C_blue_mitted.JPG/1200px-Ragdoll%2C_blue_mitted.JPG",
    "description": "Felix is a laid-back and friendly Ragdoll who loves to relax and be pampered. His soft, fluffy coat and striking blue eyes make him a stunning companion. Felix is known for his docile and placid temperament, making him an ideal pet for families with children or other pets. He loves to follow his human companions around the house, often flopping down at their feet or jumping into their laps for a cozy nap. Felix is very affectionate and enjoys being petted and brushed, which helps to maintain his luxurious coat. His calm demeanor and loving nature make him a wonderful addition to any home looking for a loyal and gentle feline friend.",
    "location": "Philadelphia",
    "liked": false
  },
  {
    "id": "23",
    "name": "Milo",
    "age": "3 months",
    "gender": "male",
    "castrated": "no",
    "type": "Cat",
    "breed": "Abyssinian",
    "image": "https://www.petrebels.com/en/wp-content/uploads/sites/3/2023/03/sergey-semin-slJ2lG1Pego-unsplash-1024x681-1.jpg",
    "description": "Milo is an energetic and playful Abyssinian kitten who loves to climb and explore. His sleek, muscular build and expressive almond-shaped eyes reflect his lively and adventurous spirit. Milo is incredibly curious and intelligent, always looking for new things to discover and play with. He is known for his agility and loves to climb, so having plenty of cat trees and shelves will keep him happy and entertained. Despite his playful nature, Milo is also very affectionate and enjoys snuggling up with his humans after a day of fun and games. He will thrive in a home that can provide plenty of stimulation and affection, making him a delightful and dynamic companion.",
    "location": "San Jose",
    "liked": false
  },
  {
    "id": "24",
    "name": "Frosty",
    "age": "1 year",
    "gender": "male",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Netherland Dwarf",
    "image": "https://images.squarespace-cdn.com/content/v1/5f11acca056d9b31bdc66141/1615231975008-W01J1YOKDNMNKWUK25A2/IMG_3961_jpg.jpg",
    "description": "Frosty is a small and sweet Netherland Dwarf rabbit who loves to be held and petted. His petite size and adorable features make him a charming little companion. Frosty enjoys gentle interaction and will often sit quietly in your lap, enjoying the attention and affection. He is curious and likes to explore his surroundings, but he always returns to his favorite spot for a cuddle. Frosty is well-suited for families or individuals who can provide him with the love and care he craves. His friendly and gentle nature makes him an ideal pet for those looking for a calm and affectionate rabbit.",
    "location": "Orlando",
    "liked": false
  },
  {
    "id": "25",
    "name": "Bella",
    "age": "2 years",
    "gender": "female",
    "castrated": "no",
    "type": "Rabbit",
    "breed": "Mini Rex",
    "image": "https://media-be.chewy.com/wp-content/uploads/mini-rex-main.jpg",
    "description": "Bella is a friendly and curious Mini Rex rabbit who loves to explore and play. Her soft, velvety fur and expressive eyes make her a joy to pet and interact with. Bella is very social and enjoys being around people, often hopping over to see what you’re up to. She loves to explore her environment, so providing her with plenty of toys and space to roam will keep her happy and stimulated. Bella is also quite playful and enjoys engaging in fun activities with her human companions. Her lively and affectionate personality makes her a wonderful addition to any home looking for a playful and interactive rabbit.",
    "location": "Cincinnati",
    "liked": false
  },
  {
    "id": "26",
    "name": "Cotton",
    "age": "1.5 years",
    "gender": "male",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Flemish Giant",
    "image": "https://image.petmd.com/files/styles/978x550/public/2023-07/Flemish.giant_.jpg",
    "description": "Cotton is a large and gentle Flemish Giant rabbit who enjoys lounging and being around people. His impressive size and gentle demeanor make him a striking yet soothing presence in any home. Cotton loves to relax and often stretches out in his favorite spot, enjoying the tranquility. Despite his size, he is very gentle and enjoys being petted and cuddled. Cotton is also quite sociable and likes to be near his human companions, often following them around the house. His calm and friendly nature makes him an excellent pet for families or individuals looking for a large, gentle, and affectionate rabbit.",
    "location": "Atlanta",
    "liked": false
  },
  {
    "id": "27",
    "name": "Thistle",
    "age": "3 years",
    "gender": "male",
    "castrated": "no",
    "type": "Rabbit",
    "breed": "English Angora",
    "image": "https://m.media-amazon.com/images/I/71Iq5i7B7bL._AC_UF350,350_QL80_.jpg",
    "description": "Thistle is a fluffy and friendly English Angora rabbit who loves to be groomed and cuddled. His luxurious, long fur requires regular grooming, which he enjoys as it gives him extra time with his favorite humans. Thistle is very affectionate and loves to be held, often snuggling into your arms. He is also quite playful and enjoys exploring his surroundings, though he always comes back for some grooming and cuddles. Thistle’s gentle and loving nature makes him an ideal pet for those who enjoy spending time grooming and interacting with their rabbit. His fluffy appearance and sweet personality make him a delightful companion.",
    "location": "Charlotte",
    "liked": false
  },
  {
    "id": "28",
    "name": "Hopper",
    "age": "2 years",
    "gender": "male",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Dutch",
    "image": "https://curiodyssey.org/wp-content/uploads/2021/05/animal-dutch-rabbit.jpg",
    "description": "Hopper is an active and curious Dutch rabbit who loves to hop around and explore. His striking black-and-white markings and lively personality make him a standout companion. Hopper is very energetic and enjoys spending time exploring new environments and playing with toys. He is also quite social and enjoys interacting with his human companions, often hopping around their feet in excitement. Despite his active nature, Hopper also enjoys quiet moments and will happily snuggle up for some petting and affection. His inquisitive and playful personality makes him a wonderful addition to any home looking for an active and engaging rabbit.",
    "location": "Indianapolis",
    "liked": false
  },
  {
    "id": "29",
    "name": "Pepper",
    "age": "1 year",
    "gender": "male",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Holland Lop",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Holland_lop_rabbit.jpg/2560px-Holland_lop_rabbit.jpg",
    "description": "Pepper is a lively and playful Holland Lop rabbit who loves to interact with people and explore new environments. His adorable lop ears and compact size make him an endearing companion. Pepper is very social and enjoys being the center of attention, often seeking out his human companions for playtime and interaction. He loves to explore his surroundings and is always on the lookout for new adventures. Pepper is also very affectionate and enjoys being petted and cuddled. His playful and friendly nature makes him an ideal pet for families or individuals looking for an active and engaging rabbit.",
    "location": "Portland",
    "liked": false
  },
  {
    "id": "30",
    "name": "Fluffy",
    "age": "2 years",
    "gender": "female",
    "castrated": "no",
    "type": "Rabbit",
    "breed": "Lionhead",
    "image": "https://www.shutterstock.com/image-photo/cute-portrait-lionhead-rabbit-green-600nw-779234086.jpg",
    "description": "Fluffy is a gentle and affectionate Lionhead rabbit who enjoys being petted and spending time with humans. Her distinctive mane of fur around her head gives her a charming and unique appearance. Fluffy is very friendly and loves to be around people, often seeking out attention and affection. She enjoys being petted and will often sit quietly in your lap, enjoying the gentle interaction. Fluffy is also quite playful and enjoys exploring her environment, though she always comes back for some cuddle time. Her gentle and loving nature makes her a wonderful addition to any home looking for a sweet and affectionate rabbit.",
    "location": "Seattle",
    "liked": false
  },
  {
    "id": "31",
    "name": "Cinnamon",
    "age": "3 years",
    "gender": "female",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Rex",
    "image": "https://images.squarespace-cdn.com/content/v1/5bb56e2290f904412702cc2e/1538674334825-SNYCXGCQKI3OH89BP90R/IMG_20180511_190858.jpg",
    "description": "Cinnamon is a calm and curious Rex rabbit who loves to explore and enjoys gentle interactions. Her velvety fur and calm demeanor make her a soothing presence in any home. Cinnamon is very curious and enjoys exploring her surroundings, often hopping around to investigate new areas. She is also very gentle and enjoys being petted and cuddled, making her a great companion for quiet moments. Cinnamon’s calm and friendly nature makes her an ideal pet for families or individuals looking for a gentle and affectionate rabbit. She thrives on gentle interaction and will quickly become a beloved member of any household.",
    "location": "Denver",
    "liked": false
  },
  {
    "id": "32",
    "name": "Smokey",
    "age": "3 years",
    "gender": "male",
    "castrated": "no",
    "type": "Cat",
    "breed": "British Shorthair",
    "image": "https://www.omlet.de/images/cache/512/341/British-shorthair-colourpoint-cat.jpg",
    "description": "Smokey is a laid-back British Shorthair cat who loves napping in cozy corners and being gently brushed. His calm demeanor and soft fur make him a soothing presence at home.",
    "location": "Boston",
    "liked": false
  },
  {
    "id": "33",
    "name": "Coco",
    "age": "2 years",
    "gender": "female",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Mini Lop",
    "image": "https://image.jimcdn.com/app/cms/image/transf/dimension=635x10000:format=jpg/path/se0249c7eda2b41e6/image/i10f4fa2ac8195dc6/version/1514473072/image.jpg",
    "description": "Coco is a curious and affectionate Mini Lop rabbit who enjoys exploring tunnels and playing with chew toys. Her friendly nature and soft fur make her a delightful addition to any rabbit-loving household.",
    "location": "Phoenix",
    "liked": false
  },
  {
    "id": "34",
    "name": "Ruffel",
    "age": "1 year",
    "gender": "male",
    "castrated": "no",
    "type": "Dog",
    "breed": "Boxer",
    "image": "https://www.shutterstock.com/image-photo/sweet-little-boxer-puppy-stand-600nw-1848249871.jpg",
    "description": "Ruffel is a playful Boxer who loves to bounce around and play fetch. His goofy personality and boundless energy make him a cherished companion for active families.",
    "location": "Philadelphia",
    "liked": false
  },
  {
  "id": "35",
  "name": "Zephyr",
  "age": "5 years",
  "gender": "female",
  "castrated": "no",
  "type": "Dog",
  "breed": "Australian Shepard",
  "image": "https://www.josera.de/media/wysiwyg/ratgeber-de/ratgeber-hund/rassen/australian-shepherd/maud-slaats-F6fM4Yay0mY-unsplash_small.jpg",
  "description": "Zephyr is a charismatic Ring-Tailed Lemur known for her distinctive black and white striped tail. She enjoys climbing trees, sunbathing, and engaging in playful antics with her troop. Zephyr's curious nature and social behavior make her an enchanting addition to any exotic animal enthusiast's home.",
  "location": "San Diego",
  "liked": false
},
  {
    "id": "36",
    "name": "Apollo",
    "age": "5 months",
    "gender": "male",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Australian Shepherd",
    "image": "https://image.jimcdn.com/app/cms/image/transf/dimension=4096x4096:format=jpg/path/s9a5544457b718526/image/idc4cbf419d18b836/version/1698107729/image.jpg",
    "description": "Apollo is an intelligent and energetic Australian Shepherd who excels in agility and obedience training. His striking blue merle coat and friendly disposition make him a beloved companion for active families.",
    "location": "Austin",
    "liked": false
  },
  {
    "id": "37",
    "name": "Willow",
    "age": "8 months",
    "gender": "female",
    "castrated": "no",
    "type": "Cat",
    "breed": "Siamese",
    "image": "https://images.wagwalkingweb.com/media/daily_wag/blog_articles/hero/1678934108.5188236/everything-you-need-to-know-about-siamese-cats.png",
    "description": "Willow is an elegant Siamese cat with striking blue eyes and a vocal personality. She enjoys lounging in sunny spots and engaging in interactive play with feather toys.",
    "location": "San Antonio",
    "liked": false
  },
  {
    "id": "38",
    "name": "Bandit",
    "age": "1.5 years",
    "gender": "male",
    "castrated": "yes",
    "type": "Rabbit",
    "breed": "Miniature Lion Lop",
    "image": "https://i.pinimg.com/originals/a8/c5/c3/a8c5c3af4c22fc83cb9ccb506513deb9.png",
    "description": "Bandit is a mischievous Miniature Lion Lop rabbit with a fluffy mane and a penchant for exploring. He loves to hop around and enjoys playing with tunnel toys and nibbling on fresh herbs.",
    "location": "Las Vegas",
    "liked": false
  },
  {
    "id": "39",
    "name": "Bello",
    "age": "7 months",
    "gender": "male",
    "castrated": "no",
    "type": "Dog",
    "breed": "Shiba Inu",
    "image": "https://christopherus-hund.de/files/media/images/Blog/2024/Rasseportrait%3A%20der%20Shiba%20Inu/Christopherus_Magazin_Artikel_Shiba_Inu_Teaser.jpg",
    "description": "Loki is an independent and spirited Shiba Inu known for his fox-like appearance and loyalty. He enjoys outdoor adventures and prefers a structured routine with his human family.",
    "location": "Nashville",
    "liked": false
  },
  {
    "id": "40",
    "name": "Mia",
    "age": "1 year",
    "gender": "female",
    "castrated": "no",
    "type": "Cat",
    "breed": "Bengal",
    "image": "https://www.zooroyal.de/magazin/wp-content/uploads/2015/08/Bengalkatze2-760x570.jpg",
    "description": "Mia is a playful Bengal cat with striking leopard-like markings and an active personality. She loves interactive toys and climbing high perches to observe her surroundings.",
    "location": "Orlando",
    "liked": false
  },
  {
    "id": "41",
    "name": "Susi",
    "age": "13 year",
    "gender": "female",
    "castrated": "yes",
    "type": "Dog",
    "breed": "Poodle",
    "image": "https://static.wixstatic.com/media/0bfe04_c8b08dc6da434280b5ffaf6102510453~mv2.jpg/v1/crop/x_268,y_0,w_1780,h_1530/fill/w_400,h_344,al_c,q_80,usm_0.66_1.00_0.01,enc_auto/Carino_JPG.jpg",
    "description": "Meet Susi, a charming 13-year-old female Poodle from New York. Susi has a gentle demeanor and a heartwarming presence that lights up any room she enters. Her soft, curly fur and expressive eyes make her irresistible to anyone she meets. Despite her age, Susi is full of energy and loves going for walks in the park, where she enjoys sniffing around and exploring her surroundings. She's been a cherished companion and is dearly loved in her home. Susi is already spayed (castrated), ensuring she's happy and healthy for many more years of companionship. If you're looking for a loyal friend who exudes warmth and affection, Susi is the perfect match for you",
    "location": "New York",
    "liked": false
  }
]
